app/views/articles/show.html.erb

<ul>
  <li><%= Article.find(2).title %></li>
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

<h2>Comments</h2>
<% @art.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]