app/views/creators/show.html.erb

SELECT `users`.* FROM `users` INNER JOIN `creators_users` ON `users`.`id` = `creators_users`.`user_id` WHERE `creators_users`.`creator_id` = 5
---
<h2>user list</h2>
<% @cre.users.each do |user| %>