app/controllers/articles_controller.rb

  def index
    @articles = Article.all
    @creators = Creator.all
    @users = User.all
---
SELECT `articles`.* FROM `articles`
SELECT `creators`.* FROM `creators`
SELECT `users`.* FROM `users`

  def show
    @art = Article.find(params[:id])
---
SELECT `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1

  def create
    @article = Article.new(article_params)

    if @article.save
---
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`) VALUES ('asdf', 'asdfasdfasdf', '2022-02-17 08:05:39.164759', '2022-02-17 08:05:39.164759')