app/controllers/creators_controller.rb

SELECT `creators`.* FROM `creators`
---
  def index
    @creators = Creator.all

SELECT `creators`.* FROM `creators` WHERE `creators`.`id` = 5 LIMIT 1
---
  def show
    @cre = Creator.find(params[:id])

INSERT INTO `creators` (`channel`, `contents`, `created_at`, `updated_at`) VALUES ('...', '...', '2022-02-17 07:43:47.081876', '2022-02-17 07:43:47.081876')
---
  def create
    @creator = Creator.new(creator_params)

    if @creator.save