app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `age`, `created_at`, `updated_at`) VALUES ('en', '10', '2022-02-19 18:58:50.425690', '2022-02-19 18:58:50.425690')
---
  def create
    @user = User.new(users_params)

    if @user.save

DELETE FROM `creators_users` WHERE `creators_users`.`user_id` = 7
DELETE FROM `users` WHERE `users`.`id` = 7
---
  def destroy
    # @creuser = CreatorsUsers.find(params[:id])
    @creuser = CreatorsUsers.where(user_id:params[:id])
    @creuser.destroy