app/controllers/users_controller.rb

  def create
    @creator = Creator.find(params[:creator_id])
---
SELECT `creators`.* FROM `creators` WHERE `creators`.`id` = 5 LIMIT 1